import { Component } from '@angular/core';
import { NavController } from 'ionic-angular';
import { AlertController } from 'ionic-angular';

@Component({
  selector: 'page-home',
  templateUrl: 'home.html'
})
export class HomePage {

  constructor(public navCtrl: NavController , public alerCtrl: AlertController) {

  }




  


  doAlert3() {
    let alert = this.alerCtrl.create({
      title: '  السیاحة المغامراتیة والسفر',
      message: 'تعتبرهذه‌ السياحة واحدة من أسرع الأسواق المتنامية في قطاعات صناعة السياحة و بمعدل نمو عالمي يصل الى حوالى  18٪ سنويا. تتضمن هذه السياحة أنشطة اساسية  نذكر منها  مغامرة السفر، المشي لمسافات طويلة، ركوب الدراجات العادیة و الجبلیة، تسلق الجبال، الصخور و الهضاب، التخييم، السباحة و الرياضات المائية و ركوب الخيل. أما ما يساعد على القيام بهذه الرياضات والأنشطة فهو احتواء كوردستان  على الجبال، البحيرات، الأنهار والعجائب الطبيعية الأخرى.',
      buttons: ['Ok']
    });
    alert.present()
  }



  doAlert4() {
    let alert = this.alerCtrl.create({
      title: 'السياحة الثقافية',
      message: 'هذه‌ السیاحة هي واحدة من القطاعات الأسرع نموا بحيث يقدر عدد ممارسیها بحوالي 10٪ من السياح في جميع أنحاء العالم. فزیارة المواقع الأثرية و المعالم الثقافیة يمكن أن يساهم في جعلها واحدة من الفعالیات الرئیسیة في هذا النوع من السیاحة. وبإستطاعة إقلیم کوردستان تقدیم أمور كثير متنوعة وفريدة من نوعها  للسائحین، وذلك لکثرة المواقع الأثریة و لأهميتها التاريخية.',
      buttons: ['Ok']
    });
    alert.present()
  }




  doAlert5() {
    let alert = this.alerCtrl.create({
      title: 'السياحة الداخلیة',
      message: 'تلعب مکانة إقلیم کوردستان و خصوصیتها المتنوعة الفریدة في المنطقة و خارجها أیضا، دورا مهما في استقطاب  السائحین و الزائرين من جنوب العراق، بلدان الخليج و مناطق أخرى من الشرق الأوسط، بهدف التمتع بمناظر الجبال الشاهقة و الطبیعة  الخلابة، خلال أشهر الصيف الحار. کذلك یرتادون المواقع الدينية، الثقافية و التراثية على مدار العام.',
      buttons: ['Ok']
    });
    alert.present()
  }


  
  doAlert6() {
    let alert = this.alerCtrl.create({
      title: 'السياحة الدينية',
      message: 'يزداد هذا النوع من السیاحة بومآ بعد یوم، نظرا لمکانة و إزدیاد المسائل الدینیة و الروحانیة، لدی المؤمنین و المهتمین بها، کذلك عند المتابعين و الشغوفين بها. تدار هذه‌ السیاحة‌ من قبل الأفراد، الجماعات أو الجهات المختصة. فأرض إقلیم کوردستان هي مهبط الأدیان السماویة، الاسلام، المسیحیة و الیهودیة و کانت و لا تزال منبرا مهما للمذاهب و المعتقدات الأخری. ',
      buttons: ['Ok']
    });
    alert.present()
  }

}
